#include<stdio.h>

/*
tip1.  * 與 ++的優先順序相同的，它們的結合性都是自右向左
tip2.  （）的優先順序高於*和++
tip3. ++在變數後，等全部運算完在+1，優先級最低，最後在做

p = pointer

p++ = 指標位址+1
*(p++) => 先 *p(p位址的資料) “指標”再 +1(p++)
*p++ => 從右邊開始先 p++ 再 * =>p(指標位址+1) 的資料
++*p => 從右邊開始先 *p 再將p的資料 +1
(p*)++ => p的資料+1

*/

int main()
{
int a[5]={1,2,3,4,5};
int *p = a;

*(p++)+=123;// = *p += 123, p++ => [1+123,2,3,4,5] (p指向a[1])
*(++p)+=123;// = p++ => *p += 123 => [124,2,3+123,4,5] (p指向a[2])
for (int i = 0; i < 5; i++)
{
    printf("%d ",a[i]);
}
    return 0;
}