#include<stdio.h>

/*
tip1.  * 與 ++的優先順序相同的，它們的結合性都是自右向左
tip2.  （）的優先順序高於*和++
tip3. ++在變數後，等全部運算完在+1，優先級最低，最後在做
tip4. *p++ 與  (*p)++ 注意後者因為++前面是值(*p), ++做完才print ,前者++前是p,所以先印*p在p++

p = pointer

p++ = 指標位址+1
*(p++) => 先 *p(p位址的資料) “指標”再 +1(p++)
*p++ => ++最後 所以 先取p的資料 p指標+1
++*p => 從右邊開始先 *p 再將p的資料 +1
(p*)++ => p的資料+1

*/

int main()
{
    char s[]="0113256";// {0,1,1,3,2,5,6}
    char *p=s;
    printf("%c",*p++);//*p -> print 0 -> p++ => s[1]  {0,1,1,3,2,5,6}
    printf("%c",*(p++));// = *p++ -> print 1(s[1])  -> p++ => s[2]  {0,1,1,3,2,5,6}
    printf("%c",(*p)++);// print *p s[2] = 1 -> s[2]++ = 2  {0,1,2,3,2,5,6}
    printf("%c",*++p);// p++ = s[3] -> *p = 3  {0,1,2,3,2,5,6}
    printf("%c",*(++p));//p++ = s[4] -> *p = 2  {0,1,2,3,2,5,6}
    printf("%c",++*p);// *p = 2-> s[4]++ = 3 -> print 3, p 還在s[4] {0,1,2,3,3,5,6}
    printf("%c",++(*p));// *p = s[4] = 3 -> s[4]++ = 4   {0,1,2,3,3,5,6}
    printf("\n%s",s);
    return 0;
}